let mock = {
    KeShiJieYuInitMock: () => {
        return new Promise((resolve, reject) => {
            resolve({
                data: {
                    code: 1,
                    data: {
                        '病种正结余': [{
                                "月份": "2024-05",
                                "病种名称": "老年性初期白内障+白内障超声乳化抽吸术+白内障摘除伴人工晶体一期置入术",
                                "医保结余": "40680.09",
                                "CMI": "1.3807"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他呼吸性疾患:诊断性操作组",
                                "医保结余": "27521.04",
                                "CMI": "1.8985"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "经大转子骨折+股骨骨折闭合复位髓内针内固定术",
                                "医保结余": "25900.29",
                                "CMI": "3.9007"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "股骨颈骨折+人工股骨头置换术",
                                "医保结余": "16525.47",
                                "CMI": "5.1277"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "骨质疏松伴有病理性骨折:相关手术组",
                                "医保结余": "14276.4",
                                "CMI": "3.7784"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "肾(除外肾盂)恶性肿瘤+腹腔镜下单侧肾切除术",
                                "医保结余": "12650.77",
                                "CMI": "3.6257"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "直肠恶性肿瘤+腹腔镜下直肠根治术",
                                "医保结余": "12462.22",
                                "CMI": "6.5157"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "复杂性偏头痛",
                                "医保结余": "9360.71",
                                "CMI": "1.1671"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "入脑前动脉的闭塞和狭窄，未造成脑梗死:治疗性操作组",
                                "医保结余": "8742.29",
                                "CMI": "4.6702"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "大脑中动脉闭塞和狭窄",
                                "医保结余": "7037.89",
                                "CMI": "1.036"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "大脑动脉的闭塞和狭窄，未造成脑梗死:诊断性操作组",
                                "医保结余": "6875.11",
                                "CMI": "2.0554"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他间质性肺疾病:治疗性操作组",
                                "医保结余": "5870.71",
                                "CMI": "2.6741"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "肺炎，病原体未特指:治疗性操作组",
                                "医保结余": "5805.46",
                                "CMI": "3.9713"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他脑血管病:诊断性操作组",
                                "医保结余": "5548.79",
                                "CMI": "1.4181"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "慢性肛裂+肛裂切除术+痔切除术",
                                "医保结余": "5258.54",
                                "CMI": "1.2457"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "肾积脓+经尿道输尿管/肾盂激光碎石取石术",
                                "医保结余": "4900.65",
                                "CMI": "2.2356"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他脑血管病:相关手术组",
                                "医保结余": "4468.14",
                                "CMI": "15.631"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "大脑动脉的闭塞和狭窄，未造成脑梗死:治疗性操作组",
                                "医保结余": "4424.97",
                                "CMI": "2.561"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "涉及使用未特指康复操作的医疗",
                                "医保结余": "3721.62",
                                "CMI": "1.7832"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "卵巢、输卵管和阔韧带的非炎性疾患:相关手术组",
                                "医保结余": "3635.13",
                                "CMI": "1.5215"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "梗阻性和反流性尿路病:治疗性操作组",
                                "医保结余": "3398.75",
                                "CMI": "1.35"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的多神经病",
                                "医保结余": "3080.96",
                                "CMI": ".8497"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "慢性萎缩性胃炎+胃镜下活组织检查",
                                "医保结余": "2820.44",
                                "CMI": "1.154"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "肛门直肠脓肿+肛周脓肿切开引流术",
                                "医保结余": "2678.81",
                                "CMI": "1.2453"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "慢性肝衰竭",
                                "医保结余": "2589.38",
                                "CMI": "1.5716"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "肺的其他疾患+纤维支气管镜检查伴肺泡灌洗术",
                                "医保结余": "2571.96",
                                "CMI": "1.3904"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "多个和双侧大脑动脉闭塞和狭窄",
                                "医保结余": "2389.68",
                                "CMI": ".9457"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "姑息性医疗",
                                "医保结余": "2257.68",
                                "CMI": ".937"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "食管炎+胃镜检查",
                                "医保结余": "2201.63",
                                "CMI": ".664"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的溃疡性结肠炎",
                                "医保结余": "2140.05",
                                "CMI": ".8926"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "动脉硬化性心脏病+胃镜检查",
                                "医保结余": "2075.21",
                                "CMI": ".9916"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "心房颤动和心房扑动，未特指",
                                "医保结余": "2073.23",
                                "CMI": ".7516"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他的脊椎关节强硬",
                                "医保结余": "1943.76",
                                "CMI": "1.0047"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "子宫粘膜下平滑肌瘤+宫腔镜子宫病损电切术",
                                "医保结余": "1841.27",
                                "CMI": ".9934"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "子宫部位未特指的恶性肿瘤",
                                "医保结余": "1839.42",
                                "CMI": ".7731"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "入脑前动脉栓塞引起的脑梗死",
                                "医保结余": "1724.87",
                                "CMI": "1.3729"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "面神经的其他疾患",
                                "医保结余": "1697.13",
                                "CMI": ".7326"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "前列腺充血和出血",
                                "医保结余": "1591.93",
                                "CMI": ".5945"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他慢性阻塞性肺病:诊断性操作组",
                                "医保结余": "1583.54",
                                "CMI": "1.4633"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他糖蛋白代谢紊乱",
                                "医保结余": "1581.27",
                                "CMI": ".7432"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "泌尿系统的其他疾患:治疗性操作组",
                                "医保结余": "1542.42",
                                "CMI": "1.9011"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "支气管炎，未特指为急性或慢性:诊断性操作组",
                                "医保结余": "1494.54",
                                "CMI": "1.0883"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "主要为变应性哮喘",
                                "医保结余": "1390.29",
                                "CMI": ".6839"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "上呼吸道的其他疾病:诊断性操作组",
                                "医保结余": "1321.04",
                                "CMI": "1.0753"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "动脉硬化性心脏病",
                                "医保结余": "1263",
                                "CMI": ".7135"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的胃炎+胃镜检查",
                                "医保结余": "1262.57",
                                "CMI": ".7083"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的肠梗阻",
                                "医保结余": "1132.4",
                                "CMI": ".6156"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "局限性水肿",
                                "医保结余": "1055.69",
                                "CMI": ".4798"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "颈动脉闭塞和狭窄",
                                "医保结余": "992.37",
                                "CMI": ".9329"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "肺脓肿不伴有肺炎",
                                "医保结余": "956.27",
                                "CMI": "1.1724"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的间质性肺病",
                                "医保结余": "892.87",
                                "CMI": ".8473"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他椎间盘疾患:诊断性操作组",
                                "医保结余": "880.22",
                                "CMI": "1.1942"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他特指的脑神经疾患",
                                "医保结余": "813.68",
                                "CMI": ".7147"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "肱骨上端骨折+肱骨骨折切开复位钢板内固定术",
                                "医保结余": "779.24",
                                "CMI": "3.0614"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "2型糖尿病伴有酮症酸中毒+胃镜检查",
                                "医保结余": "734.97",
                                "CMI": "1.4709"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "2型糖尿病伴有周围循环并发症",
                                "医保结余": "732.95",
                                "CMI": ".7467"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "唇及口腔粘膜的其他疾病:相关手术组",
                                "医保结余": "686.77",
                                "CMI": ".7127"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "椎基底动脉综合征+胃镜检查+结肠镜下大肠活组织检查",
                                "医保结余": "681.94",
                                "CMI": "1.1388"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "肛瘘+肛门瘘管切开术",
                                "医保结余": "675.41",
                                "CMI": "1.1748"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "R:保守内科治疗",
                                "医保结余": "675.26",
                                "CMI": ".4222"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "2型糖尿病:诊断性操作组",
                                "医保结余": "655.74",
                                "CMI": "1.4116"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "胆管结石不伴有胆管炎或胆囊炎",
                                "医保结余": "627.08",
                                "CMI": ".7265"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的子宫平滑肌瘤+腹腔镜子宫病损切除术",
                                "医保结余": "529.37",
                                "CMI": "1.3859"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "滑膜和肌腱的自发性破裂:相关手术组",
                                "医保结余": "519.1",
                                "CMI": "1.6196"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "多发性和未特指部位的急性上呼吸道感染:诊断性操作组",
                                "医保结余": "433.39",
                                "CMI": ".5916"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "腰椎骨折",
                                "医保结余": "421.28",
                                "CMI": ".6564"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "眼睑的其他疾患:相关手术组",
                                "医保结余": "388.46",
                                "CMI": ".4643"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "皮肤脓肿、疖和痈:相关手术组",
                                "医保结余": "373.36",
                                "CMI": ".8054"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "子宫未特指的炎性疾病+宫腔镜检查",
                                "医保结余": "369.05",
                                "CMI": ".5918"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的心绞痛+单根导管的冠状动脉造影术",
                                "医保结余": "359.72",
                                "CMI": "1.325"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "心绞痛:诊断性操作组",
                                "医保结余": "288.48",
                                "CMI": "1.7412"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他和未特指的肠梗阻",
                                "医保结余": "284.3",
                                "CMI": ".7842"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "单侧或未特指的腹股沟疝，不伴有梗阻或坏疽+单侧腹股沟斜疝无张力修补术",
                                "医保结余": "250.12",
                                "CMI": ".9641"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "不稳定性心绞痛+胃镜检查+电子结肠镜检查",
                                "医保结余": "191.14",
                                "CMI": "1.376"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "医疗性流产_完全性或未特指，无并发症+流产后刮宫术",
                                "医保结余": "150.65",
                                "CMI": ".4411"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的正常妊娠监督",
                                "医保结余": "123.79",
                                "CMI": ".1903"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "腰椎扭伤和劳损",
                                "医保结余": "97.77",
                                "CMI": ".5646"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "鼻出血+控制鼻出血，用筛动脉结扎术",
                                "医保结余": "71.07",
                                "CMI": ".3743"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "动脉硬化性心脏病+单根导管的冠状动脉造影术",
                                "医保结余": "62.68",
                                "CMI": "1.0945"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "脑梗死:治疗性操作组",
                                "医保结余": "47.58",
                                "CMI": "3.1523"
                            }
                        ],
                        '病种负结余': [{
                                "月份": "2024-05",
                                "病种名称": "良性阵发性眩晕",
                                "医保结余": "-12.81",
                                "CMI": ".6362"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的肾衰竭",
                                "医保结余": "-24.45",
                                "CMI": ".8405"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他间质性肺疾病:诊断性操作组",
                                "医保结余": "-73.66",
                                "CMI": "1.3907"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指原因的变应性接触性皮炎",
                                "医保结余": "-86.95",
                                "CMI": ".5248"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他急性胃炎+胃镜检查",
                                "医保结余": "-107.32",
                                "CMI": ".613"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他和未特指的传染病",
                                "医保结余": "-116",
                                "CMI": ".7224"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "身体未特指部位的损伤:相关手术组",
                                "医保结余": "-127.96",
                                "CMI": ".6142"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "不稳定性心绞痛+单根血管操作+置入一根血管支架+冠状动脉药物涂层支架置入术+单根导管的冠状动脉造影术",
                                "医保结余": "-141.99",
                                "CMI": "3.5112"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "耳前窦道和囊肿+耳前瘘管切除术",
                                "医保结余": "-142.39",
                                "CMI": ".4502"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的急性上呼吸道感染",
                                "医保结余": "-164.59",
                                "CMI": ".3047"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的偏头痛",
                                "医保结余": "-177.05",
                                "CMI": ".6964"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "急性阑尾炎伴局限性腹膜炎",
                                "医保结余": "-182.25",
                                "CMI": ".8094"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他周围性眩晕",
                                "医保结余": "-189.59",
                                "CMI": ".7125"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "腱鞘囊肿+腱鞘囊肿切除术",
                                "医保结余": "-242.97",
                                "CMI": ".4901"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "急性扁桃体炎:诊断性操作组",
                                "医保结余": "-250.34",
                                "CMI": "1.5825"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指病因的胃肠炎和结肠炎",
                                "医保结余": "-257.19",
                                "CMI": ".3191"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "胆囊结石伴有其他胆囊炎",
                                "医保结余": "-264.22",
                                "CMI": ".7937"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "鼻出血",
                                "医保结余": "-264.36",
                                "CMI": ".3024"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "腕管综合征+腕管松解术",
                                "医保结余": "-273.57",
                                "CMI": ".6754"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "2型糖尿病伴有神经的并发症",
                                "医保结余": "-291.36",
                                "CMI": ".7786"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "急性喉炎",
                                "医保结余": "-330.16",
                                "CMI": ".3121"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的胸痛",
                                "医保结余": "-333.87",
                                "CMI": ".3935"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "指和趾的蜂窝织炎",
                                "医保结余": "-357.4",
                                "CMI": ".2287"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "阵发性心房颤动",
                                "医保结余": "-387.99",
                                "CMI": ".7006"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他动脉的动脉粥样硬化",
                                "医保结余": "-389.58",
                                "CMI": ".5267"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的中耳炎",
                                "医保结余": "-395.87",
                                "CMI": ".3168"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "高胆红素血症，不伴黄疸",
                                "医保结余": "-432.55",
                                "CMI": ".3385"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的阑尾炎",
                                "医保结余": "-438.15",
                                "CMI": ".3484"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "偏头痛:诊断性操作组",
                                "医保结余": "-452.51",
                                "CMI": ".8683"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "2型糖尿病伴有肾的并发症",
                                "医保结余": "-461.47",
                                "CMI": ".8412"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "心绞痛:治疗性操作组",
                                "医保结余": "-507.17",
                                "CMI": "1.6776"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "乳房良性肿瘤+乳房病损切除术",
                                "医保结余": "-516.11",
                                "CMI": ".5094"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "胆管结石伴有胆管炎",
                                "医保结余": "-547.26",
                                "CMI": ".739"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "直肠息肉+内镜下直肠黏膜切除术(EMR)",
                                "医保结余": "-555.62",
                                "CMI": ".7233"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的肺炎",
                                "医保结余": "-569.73",
                                "CMI": ".5873"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "入脑前动脉血栓形成引起的脑梗死",
                                "医保结余": "-588.61",
                                "CMI": "1.051"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "心房过早除极",
                                "医保结余": "-600.43",
                                "CMI": ".7484"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指病因的胃肠炎和结肠炎+电子结肠镜检查",
                                "医保结余": "-604.14",
                                "CMI": ".6751"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他特指的医疗照顾",
                                "医保结余": "-631.46",
                                "CMI": "1.0586"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "涉及骨折板和其他内固定装置的随诊医疗+胫骨内固定装置去除术",
                                "医保结余": "-643.39",
                                "CMI": ".7215"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "C:保守内科治疗",
                                "医保结余": "-663.5",
                                "CMI": ".8817"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的癫癎",
                                "医保结余": "-698",
                                "CMI": ".5476"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的水肿",
                                "医保结余": "-704.12",
                                "CMI": ".4891"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "哮喘持续状态",
                                "医保结余": "-723.24",
                                "CMI": ".7697"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "心室过早除极",
                                "医保结余": "-737.45",
                                "CMI": ".6772"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "H:保守内科治疗",
                                "医保结余": "-772.44",
                                "CMI": ".4989"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "下肢动脉栓塞和血栓形成",
                                "医保结余": "-782.06",
                                "CMI": ".8627"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "K:保守内科治疗",
                                "医保结余": "-800.83",
                                "CMI": ".6872"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的腹膜炎",
                                "医保结余": "-807.99",
                                "CMI": ".8542"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "肠憩室病:治疗性操作组",
                                "医保结余": "-814.89",
                                "CMI": ".8159"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "颈部的局部肿胀、肿物和肿块",
                                "医保结余": "-841.03",
                                "CMI": ".3839"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "基底动脉闭塞和狭窄",
                                "医保结余": "-841.43",
                                "CMI": ".9181"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "慢性胆囊炎",
                                "医保结余": "-891.75",
                                "CMI": ".4582"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他胃炎+胃镜下活组织检查",
                                "医保结余": "-905.15",
                                "CMI": ".8006"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "胃恶性肿瘤:相关手术组",
                                "医保结余": "-910.01",
                                "CMI": "7.7145"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "T:保守内科治疗",
                                "医保结余": "-929.59",
                                "CMI": ".4932"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "胃恶性肿瘤:治疗性操作组",
                                "医保结余": "-935.26",
                                "CMI": "2.1234"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "急性心内膜下心肌梗死",
                                "医保结余": "-991.29",
                                "CMI": "1.271"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "前列腺增生:治疗性操作组",
                                "医保结余": "-1053.32",
                                "CMI": "1.2869"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "恶性肿瘤化学治疗后的随诊检查",
                                "医保结余": "-1053.86",
                                "CMI": ".5329"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "短暂性大脑缺血性发作和相关的综合征:诊断性操作组",
                                "医保结余": "-1077.27",
                                "CMI": "1.2082"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "高血压心脏病不伴有(充血性)心力衰竭",
                                "医保结余": "-1093.63",
                                "CMI": ".6004"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "涉及骨折板和其他内固定装置的随诊医疗+锁骨内固定装置去除术",
                                "医保结余": "-1102.79",
                                "CMI": ".6219"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "包皮过长、包茎和嵌顿包茎+包皮环切术",
                                "医保结余": "-1106.46",
                                "CMI": ".4427"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "急性喉炎和气管炎:诊断性操作组",
                                "医保结余": "-1120.42",
                                "CMI": ".5402"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的肝恶性肿瘤",
                                "医保结余": "-1125.27",
                                "CMI": ".9845"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "急性梗阻性喉炎[哮吼]和会厌炎:诊断性操作组",
                                "医保结余": "-1166.74",
                                "CMI": ".519"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "蜂窝织炎:相关手术组",
                                "医保结余": "-1169.8",
                                "CMI": ".7864"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他急性胃炎",
                                "医保结余": "-1188.02",
                                "CMI": ".3503"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "足骨折，除外踝:相关手术组",
                                "医保结余": "-1218.17",
                                "CMI": "1.689"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "股骨骨折:相关手术组",
                                "医保结余": "-1249.96",
                                "CMI": "5.0211"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "带状疱疹累及其他神经系统",
                                "医保结余": "-1253.93",
                                "CMI": ".5854"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "慢性浅表性胃炎+胃镜检查+电子结肠镜检查",
                                "医保结余": "-1300.74",
                                "CMI": ".8701"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "胃炎和十二指肠炎:诊断性操作组",
                                "医保结余": "-1326.15",
                                "CMI": ".9955"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "肺部继发性恶性肿瘤",
                                "医保结余": "-1330.97",
                                "CMI": ".6759"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "椎动脉闭塞和狭窄",
                                "医保结余": "-1339.42",
                                "CMI": ".9383"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他特指的脑血管疾病+胃镜检查",
                                "医保结余": "-1349.09",
                                "CMI": ".967"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "子宫体息肉+宫腔镜子宫内膜病损切除术",
                                "医保结余": "-1356.39",
                                "CMI": ".7368"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他椎间盘疾患:相关手术组",
                                "医保结余": "-1368.85",
                                "CMI": "3.9898"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他的脊椎关节强硬伴有神经根病",
                                "医保结余": "-1384.62",
                                "CMI": ".6677"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "子宫体息肉+宫腔镜子宫病损电切术",
                                "医保结余": "-1443.27",
                                "CMI": ".7251"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "皮肤和皮下组织未特指的局部感染",
                                "医保结余": "-1465.8",
                                "CMI": ".5048"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "下壁急性透壁性心肌梗死",
                                "医保结余": "-1513.12",
                                "CMI": "1.4793"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "经大转子骨折+股骨骨折切开复位髓内针内固定术",
                                "医保结余": "-1545.55",
                                "CMI": "2.9618"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "咽的其他疾病+咽部病损切除术",
                                "医保结余": "-1548.85",
                                "CMI": ".6427"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "扁桃体周脓肿",
                                "医保结余": "-1584.14",
                                "CMI": ".3703"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "肋骨、胸骨和胸部脊柱骨折:相关手术组",
                                "医保结余": "-1652.63",
                                "CMI": "4.0581"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的骨质疏松伴有病理性骨折+经皮椎体球囊扩张成形术",
                                "医保结余": "-1659.35",
                                "CMI": "3.7287"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "消化系统的其他疾病:治疗性操作组",
                                "医保结余": "-1668.69",
                                "CMI": "2.6345"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "2型糖尿病伴有多个并发症+胃镜检查+电子结肠镜检查",
                                "医保结余": "-1692.35",
                                "CMI": "1.5709"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他脑梗死",
                                "医保结余": "-1714.54",
                                "CMI": ".6808"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "充血性心力衰竭",
                                "医保结余": "-1759.43",
                                "CMI": "1.0227"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "肾盂积水伴有肾和输尿管结石梗阻",
                                "医保结余": "-1760.52",
                                "CMI": ".3547"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的肾小管_间质疾病",
                                "医保结余": "-1763.38",
                                "CMI": ".7982"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "支气管扩张(症)",
                                "医保结余": "-1800.66",
                                "CMI": ".8824"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "肾动脉的动脉粥样硬化",
                                "医保结余": "-1815.19",
                                "CMI": "1.657"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "十二指肠溃疡_慢性或未特指的，伴有出血+胃镜检查",
                                "医保结余": "-1817.32",
                                "CMI": ".938"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "肾积脓+经尿道输尿管支架置入术",
                                "医保结余": "-1827.87",
                                "CMI": ".9837"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的心力衰竭",
                                "医保结余": "-1839.91",
                                "CMI": ".9168"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "胆囊结石伴有急性胆囊炎",
                                "医保结余": "-1843.38",
                                "CMI": ".8113"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的胃肠出血",
                                "医保结余": "-1896.13",
                                "CMI": ".9005"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的脑内出血",
                                "医保结余": "-1928.84",
                                "CMI": "1.1034"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "肾积脓",
                                "医保结余": "-1933.7",
                                "CMI": ".4993"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的急性细支气管炎",
                                "医保结余": "-1938.09",
                                "CMI": ".4343"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "四肢动脉的动脉粥样硬化",
                                "医保结余": "-1945.63",
                                "CMI": ".7909"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "持续心房颤动",
                                "医保结余": "-1949.71",
                                "CMI": ".8743"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "慢性鼻炎+鼻内窥镜下鼻甲成形术",
                                "医保结余": "-2027.95",
                                "CMI": "1.4064"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "急性阑尾炎伴局限性腹膜炎+腹腔镜下阑尾切除术",
                                "医保结余": "-2058.5",
                                "CMI": "1.4645"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的异位妊娠",
                                "医保结余": "-2082.1",
                                "CMI": ".3402"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "哮喘持续状态:诊断性操作组",
                                "医保结余": "-2131.22",
                                "CMI": "2.0052"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "子宫内膜腺性增生+宫腔镜检查",
                                "医保结余": "-2131.29",
                                "CMI": ".4669"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的感音神经性听觉丧失",
                                "医保结余": "-2133.18",
                                "CMI": ".8385"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "结肠息肉+内镜下结肠黏膜切除术(EMR)",
                                "医保结余": "-2269.7",
                                "CMI": "1.0549"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的疱疹病毒感染",
                                "医保结余": "-2272.43",
                                "CMI": ".6304"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "2型糖尿病:相关手术组",
                                "医保结余": "-2277.54",
                                "CMI": "2.4415"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "直肠恶性肿瘤:相关手术组",
                                "医保结余": "-2420.93",
                                "CMI": "6.5759"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "慢性全鼻窦炎+内镜下鼻内病损切除术+内镜下全组鼻窦开窗术",
                                "医保结余": "-2427.62",
                                "CMI": "2.4014"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他特指的脑血管疾病+脑血管造影",
                                "医保结余": "-2437.09",
                                "CMI": "1.7529"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "第三[动眼]神经麻痹",
                                "医保结余": "-2478.13",
                                "CMI": ".9508"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "B:保守内科治疗",
                                "医保结余": "-2582.22",
                                "CMI": ".7221"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "涉及骨折板和其他内固定装置的随诊医疗+掌骨内固定装置去除术",
                                "医保结余": "-2625.17",
                                "CMI": ".5399"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "传导性和感音神经性听觉丧失:治疗性操作组",
                                "医保结余": "-2640.26",
                                "CMI": "1.3813"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "脊椎关节强硬:诊断性操作组",
                                "医保结余": "-2669.33",
                                "CMI": "1.1637"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "涉及骨折板和其他内固定装置的随诊医疗+桡骨内固定装置去除术",
                                "医保结余": "-2681.98",
                                "CMI": ".6048"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "硬膜下出血(急性)(非创伤性)+硬脑膜下钻孔引流术",
                                "医保结余": "-2719.28",
                                "CMI": "1.8689"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他间质性肺病伴有纤维化",
                                "医保结余": "-2767.14",
                                "CMI": ".8898"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "胆囊结石伴有其他胆囊炎+腹腔镜下胆囊切除术",
                                "医保结余": "-2796.42",
                                "CMI": "1.962"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "腹膜炎:诊断性操作组",
                                "医保结余": "-2799.56",
                                "CMI": "1.0231"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的急性支气管炎",
                                "医保结余": "-2817.64",
                                "CMI": ".3431"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "2型糖尿病伴有多个并发症",
                                "医保结余": "-2907.44",
                                "CMI": ".9711"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "麻痹性斜视:治疗性操作组",
                                "医保结余": "-2923.57",
                                "CMI": "1.0771"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "在腕和手水平的骨折:相关手术组",
                                "医保结余": "-2924.3",
                                "CMI": "1.0777"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "肺炎支原体性肺炎",
                                "医保结余": "-2972.93",
                                "CMI": ".5215"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的感音神经性听觉丧失+耳镜检查",
                                "医保结余": "-3003.83",
                                "CMI": "1.0154"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的蛛网膜下出血+脑血管造影",
                                "医保结余": "-3023.17",
                                "CMI": "2.5263"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的急性扁桃体炎",
                                "医保结余": "-3044.63",
                                "CMI": ".283"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "在踝和足水平的神经损伤:相关手术组",
                                "医保结余": "-3126.73",
                                "CMI": ".8699"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他特指的痔疮+痔切除术",
                                "医保结余": "-3149.82",
                                "CMI": ".6132"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "急性胆囊炎",
                                "医保结余": "-3193.65",
                                "CMI": ".6078"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "前列腺增生+经尿道前列腺切除术(TURP)",
                                "医保结余": "-3199.02",
                                "CMI": "1.7569"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "心房纤颤和扑动:治疗性操作组",
                                "医保结余": "-3263.72",
                                "CMI": "3.544"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "鼻息肉:相关手术组",
                                "医保结余": "-3289.17",
                                "CMI": "1.3648"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "子宫内膜异位症:相关手术组",
                                "医保结余": "-3342.21",
                                "CMI": "1.959"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "涉及骨折板和其他内固定装置的随诊医疗+髌骨内固定装置去除术",
                                "医保结余": "-3370.52",
                                "CMI": ".6795"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "胆囊结石伴有急性胆囊炎+腹腔镜下胆囊切除术",
                                "医保结余": "-3421.08",
                                "CMI": "2.0731"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "I:保守内科治疗",
                                "医保结余": "-3464.67",
                                "CMI": ".8852"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的呼吸衰竭",
                                "医保结余": "-3599.1",
                                "CMI": "1.2747"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "急性阑尾炎伴局限性腹膜炎+阑尾切除术",
                                "医保结余": "-3615.88",
                                "CMI": ".9321"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他和未特指的急性阑尾炎+腹腔镜下阑尾切除术",
                                "医保结余": "-3812.32",
                                "CMI": "1.2435"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "涉及骨折板和其他内固定装置的随诊医疗+踝关节内固定装置去除术",
                                "医保结余": "-3821.56",
                                "CMI": ".693"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "涉及骨折板和其他内固定装置的随诊医疗+跟骨内固定物取出术",
                                "医保结余": "-3923.49",
                                "CMI": ".7891"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "涉及骨折板和其他内固定装置的随诊医疗+桡骨内固定装置去除术+尺骨内固定装置去除术",
                                "医保结余": "-4048.06",
                                "CMI": ".8462"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "皮肤和皮下组织其他局部感染:治疗性操作组",
                                "医保结余": "-4105.43",
                                "CMI": "1.0567"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他肾小管_间质疾病:诊断性操作组",
                                "医保结余": "-4119.54",
                                "CMI": "2.3358"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "腰椎和骨盆其他和未特指部位的骨折",
                                "医保结余": "-4240.17",
                                "CMI": ".6771"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "子宫体恶性肿瘤:相关手术组",
                                "医保结余": "-4367.95",
                                "CMI": "3.2524"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "胆囊结石伴有急性胆囊炎+腹腔镜下胆囊切除术+腹腔镜下腹腔粘连松解术",
                                "医保结余": "-4372.7",
                                "CMI": "2.4685"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "不稳定性心绞痛+单根导管的冠状动脉造影术",
                                "医保结余": "-4398.03",
                                "CMI": "1.2397"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "2型糖尿病伴有其他特指的并发症",
                                "医保结余": "-4400.8",
                                "CMI": ".7467"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他呼吸性疾患:治疗性操作组",
                                "医保结余": "-4454.63",
                                "CMI": "5.2275"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的非毒性甲状腺肿+双侧甲状腺部分切除术",
                                "医保结余": "-4509.79",
                                "CMI": "1.6002"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "椎基底动脉综合征",
                                "医保结余": "-4518.69",
                                "CMI": ".61"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的急性胰腺炎",
                                "医保结余": "-4631.19",
                                "CMI": "1.1299"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "血管通路装置的调整和管理+下腔静脉滤器取出术+下腔静脉造影",
                                "医保结余": "-4645.77",
                                "CMI": "1.8274"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "腰椎骨折+经皮椎体球囊扩张成形术",
                                "医保结余": "-4795.03",
                                "CMI": "3.9076"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的巨细胞病毒病",
                                "医保结余": "-4846.8",
                                "CMI": ".6502"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "慢性阻塞性肺病伴有急性下呼吸道感染",
                                "医保结余": "-5101.48",
                                "CMI": ".9128"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "前列腺增生+经尿道膀胱镜膀胱激光碎石取石术+经尿道前列腺切除术(TURP)",
                                "医保结余": "-5104.8",
                                "CMI": "1.8489"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "入脑前动脉未特指的闭塞或狭窄引起的脑梗死",
                                "医保结余": "-5292.62",
                                "CMI": "1.506"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "腰和其他椎间盘疾患伴有神经根病(G55.1*)",
                                "医保结余": "-5597.07",
                                "CMI": ".8931"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "肝脓肿+肝脓肿穿刺引流术",
                                "医保结余": "-5628.32",
                                "CMI": "2.2794"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "创伤性蛛网膜下出血",
                                "医保结余": "-5660.27",
                                "CMI": ".9077"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "受压区褥疮:相关手术组",
                                "医保结余": "-5701.38",
                                "CMI": "2.8429"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "不稳定性心绞痛",
                                "医保结余": "-5704.45",
                                "CMI": ".8825"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "支气管炎，未特指为急性或慢性",
                                "医保结余": "-5802.69",
                                "CMI": ".3711"
                            },
                            {
                                "月份": "2024-05",
                                "医保结余": "-6372.54",
                                "CMI": "0"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "突发特发性听觉丧失+鼓室注射",
                                "医保结余": "-6467.37",
                                "CMI": "1.1464"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "前列腺增生+经尿道前列腺球囊扩张术",
                                "医保结余": "-6588.66",
                                "CMI": "3.1828"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的慢性支气管炎:治疗性操作组",
                                "医保结余": "-6592.98",
                                "CMI": "2.4327"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "2型糖尿病不伴有并发症",
                                "医保结余": "-6716.18",
                                "CMI": ".7467"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的支气管或肺恶性肿瘤+锁骨下静脉穿刺中心静脉置管术",
                                "医保结余": "-6844.92",
                                "CMI": "2.6174"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的心绞痛",
                                "医保结余": "-7385.11",
                                "CMI": ".8068"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "主支气管恶性肿瘤",
                                "医保结余": "-7468.33",
                                "CMI": ".7741"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "特发性(原发性)高血压+胃镜检查",
                                "医保结余": "-7671.3",
                                "CMI": ".9091"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "小腿(包括踝)骨折:相关手术组",
                                "医保结余": "-8346.33",
                                "CMI": "3.1209"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "肾动脉的动脉粥样硬化+肾动脉支架置入术+肾动脉造影术",
                                "医保结余": "-8516.95",
                                "CMI": "4.1008"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "部位未特指的泌尿道感染",
                                "医保结余": "-8805.77",
                                "CMI": ".5238"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的短暂性大脑缺血性发作",
                                "医保结余": "-10026.02",
                                "CMI": ".4845"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的膝关节病+膝关节镜下半月板成形术",
                                "医保结余": "-10231.54",
                                "CMI": "1.3054"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "大脑动脉血栓形成引起的脑梗死",
                                "医保结余": "-10440.57",
                                "CMI": "1.1646"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "局部脑损伤",
                                "医保结余": "-11577.09",
                                "CMI": "1.0916"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "急性心肌梗死:治疗性操作组",
                                "医保结余": "-12060.78",
                                "CMI": "3.0307"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "髌骨骨折+髌骨骨折切开复位张力带钢丝内固定术",
                                "医保结余": "-13332.5",
                                "CMI": "2.1297"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的支气管肺炎",
                                "医保结余": "-14197.8",
                                "CMI": ".3639"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "脑内出血后遗症",
                                "医保结余": "-14490.96",
                                "CMI": ".8356"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他特指的椎间盘移位",
                                "医保结余": "-14786.37",
                                "CMI": ".5551"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "胸椎骨折",
                                "医保结余": "-17630.74",
                                "CMI": ".6448"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "静脉炎和血栓性静脉炎:相关手术组",
                                "医保结余": "-18077.47",
                                "CMI": "3.9868"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "左心室衰竭",
                                "医保结余": "-19286.34",
                                "CMI": "1.0527"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "特发性(原发性)高血压",
                                "医保结余": "-19457.73",
                                "CMI": ".5895"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "大脑后动脉闭塞和狭窄",
                                "医保结余": "-23848.45",
                                "CMI": ".8432"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的脑梗死",
                                "医保结余": "-23971.14",
                                "CMI": ".7998"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "心力衰竭:治疗性操作组",
                                "医保结余": "-24695.94",
                                "CMI": "2.9007"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "动脉和小动脉的其他疾患:相关手术组",
                                "医保结余": "-31918.31",
                                "CMI": "6.1702"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "2型糖尿病:治疗性操作组",
                                "医保结余": "-37685.26",
                                "CMI": "1.4549"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "其他特指的脑血管疾病",
                                "医保结余": "-38859.94",
                                "CMI": ".4124"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "大脑动脉未特指的闭塞或狭窄引起的脑梗死",
                                "医保结余": "-41556.6",
                                "CMI": "1.1368"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "肺的其他疾患",
                                "医保结余": "-57967.65",
                                "CMI": ".7269"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "动脉栓塞和血栓形成:相关手术组",
                                "医保结余": "-66154.44",
                                "CMI": "5.8122"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的心力衰竭+超声引导下胸腔穿刺术",
                                "医保结余": "-66965.45",
                                "CMI": "2.0216"
                            },
                            {
                                "月份": "2024-05",
                                "病种名称": "未特指的脑梗死+气管内插管+呼吸机治疗[大于等于96小时]",
                                "医保结余": "-91834.89",
                                "CMI": "4.3341"
                            }
                        ],
                        '科室结余': [{
                                "月份": "2024-05",
                                "科室名称": "内五病区-2",
                                "医保结余": "11575.95",
                                "CMI": ".9013"
                            },
                            {
                                "月份": "2024-05",
                                "科室名称": "眼耳鼻喉科病区",
                                "医保结余": "9425.87",
                                "CMI": ".9977"
                            },
                            {
                                "月份": "2024-05",
                                "科室名称": "肛肠科病区",
                                "医保结余": "4662.11",
                                "CMI": "1.0654"
                            },
                            {
                                "月份": "2024-05",
                                "科室名称": "康复科病房",
                                "医保结余": "2792.03",
                                "CMI": "1.5252"
                            },
                            {
                                "月份": "2024-05",
                                "科室名称": "普外科一病区",
                                "医保结余": "-1954.14",
                                "CMI": "1.2329"
                            },
                            {
                                "月份": "2024-05",
                                "科室名称": "消化内科病区",
                                "医保结余": "-5137.82",
                                "CMI": ".8485"
                            },
                            {
                                "月份": "2024-05",
                                "科室名称": "内四病区",
                                "医保结余": "-6819.43",
                                "CMI": "4.5146"
                            },
                            {
                                "月份": "2024-05",
                                "科室名称": "中医科病区",
                                "医保结余": "-7712.06",
                                "CMI": ".8453"
                            },
                            {
                                "月份": "2024-05",
                                "科室名称": "妇产科病区",
                                "医保结余": "-8073.95",
                                "CMI": ".9465"
                            },
                            {
                                "月份": "2024-05",
                                "科室名称": "骨一科病区",
                                "医保结余": "-22359.65",
                                "CMI": "1.2007"
                            },
                            {
                                "月份": "2024-05",
                                "科室名称": "内五病区",
                                "医保结余": "-24740.68",
                                "CMI": "1.3074"
                            },
                            {
                                "月份": "2024-05",
                                "科室名称": "骨二科病区",
                                "医保结余": "-30939.49",
                                "CMI": "1.9682"
                            },
                            {
                                "月份": "2024-05",
                                "科室名称": "脑外病区",
                                "医保结余": "-44363.91",
                                "CMI": "1.2269"
                            },
                            {
                                "月份": "2024-05",
                                "科室名称": "儿科病区",
                                "医保结余": "-51054.29",
                                "CMI": ".4625"
                            },
                            {
                                "月份": "2024-05",
                                "科室名称": "老年病病区",
                                "医保结余": "-73114.67",
                                "CMI": "1.1162"
                            },
                            {
                                "月份": "2024-05",
                                "科室名称": "内一病区",
                                "医保结余": "-85881.39",
                                "CMI": ".9308"
                            },
                            {
                                "月份": "2024-05",
                                "科室名称": "内二病区",
                                "医保结余": "-98801.31",
                                "CMI": "1.067"
                            },
                            {
                                "月份": "2024-05",
                                "科室名称": "普外科二病区",
                                "医保结余": "-170855.39",
                                "CMI": "1.8836"
                            },
                            {
                                "月份": "2024-05",
                                "科室名称": "ICU病房",
                                "医保结余": "-224138.5",
                                "CMI": "3.1243"
                            }
                        ]
                    }
                }
            })
        })
    },
    ShowShuZhanBiInitMock: () => {
        return new Promise((resolve, reject) => {
            resolve({
                data: {
                    code: 1,
                    data: {
                        "1月": {
                            "sszb": 25,
                            "sjss": 12,
                            "wcss": 3
                        },
                        "2月": {
                            "sszb": 18,
                            "sjss": 8,
                            "wcss": 2
                        },
                        "3月": {
                            "sszb": 19,
                            "sjss": 10,
                            "wcss": 2
                        },
                        "4月": {
                            "sszb": 20,
                            "sjss": 12,
                            "wcss": 2
                        },
                        "5月": {
                            "sszb": 19,
                            "sjss": 9,
                            "wcss": 2
                        },
                        "6月": {
                            "sszb": 22,
                            "sjss": 11,
                            "wcss": 2
                        },
                        "7月": {
                            "sszb": 19,
                            "sjss": 10,
                            "wcss": 2
                        },
                        "8月": {
                            "sszb": 17,
                            "sjss": 6,
                            "wcss": 1
                        }
                    }
                }
            })
        })
    },
    WeiJiChuLiShiJianInitMock: () => {
        return new Promise((resolve, reject) => {
            resolve({
                data: {
                    code: 1,
                    data: [
                        {
                            "五分钟": 8
                        },
                        {
                            "十分钟": 8
                        },
                        {
                            "二十分钟": 1
                        },
                        {
                            "二十分钟以上": 5
                        }
                    ]
                }
            })
        })
    },
    YiLiaoFuWuShouRuInitMock: () => {
        return new Promise((resolve, reject) => {
            resolve({
                data: {
                    code: 1,
                    data: {
                        "ywxsr": {
                            "1月": 4294461,
                            "2月": 2960799,
                            "3月": 4345174,
                            "4月": 4235144,
                            "5月": 3942533,
                            "6月": 3834316,
                            "7月": 160399
                        },
                        "zfy": {
                            "1月": 13312389,
                            "2月": 9899028,
                            "3月": 13772215,
                            "4月": 13731311,
                            "5月": 12809028,
                            "6月": 12062029,
                            "7月": 473584
                        }
                    }
                }
            })
        })
    },
    ZongShouRuInitMock: () => {
        return new Promise((resolve, reject) => {
            resolve({
                data: {
                    code: 1,
                    data: {
                        '总收入': {
                            "1月": "22210316.84",
                            "2月": "16946307.77",
                            "3月": "20671301.92",
                            "4月": "20317402.74",
                            "5月": "20121861.56",
                            "6月": "18950598.13",
                            "7月": "1342525.87"
                        }
                    }
                }
            })
        })
    },
    DangRiShouRuInitMock: () => {
        new Promise((resolve, reject) => {
            resolve({
                data: {
                    code: 1,
                    data: [{
                            "类别": "住院",
                            "收入": "308588.66"
                        },
                        {
                            "类别": "健康体检",
                            "收入": "42730"
                        },
                        {
                            "类别": "门诊",
                            "收入": "160493.03"
                        }
                    ]
                }
            })
        })
    },
    YaoWuZhanBiInitMock: [
        new Promise((resolve, reject) => {
            resolve({
                data: {
                    code: 1,
                    data: {
                        "基本药物采购金额占比": {
                            "1月": 43,
                            "2月": 31,
                            "3月": 45,
                            "4月": 37,
                            "5月": 42,
                            "6月": 34,
                            "7月": 36,
                            "8月": 45,
                            "9月": 17
                        }
                    }
                }
            })
        }),
        new Promise((resolve, reject) => {
            resolve({
                data: {
                    code: 1,
                    data: {
                        "高值耗材金额占比": {
                            "1月": 33,
                            "2月": 27,
                            "3月": 25,
                            "4月": 29,
                            "5月": 27,
                            "6月": 21,
                            "7月": 22,
                            "8月": 23,
                            "9月": 32
                        }
                    }
                }
            })
        }),
        new Promise((resolve, reject) => {
            resolve({
                data: {
                    code: 1,
                    data: {
                        "重点监控药品占比": {
                            "1月": 4,
                            "2月": 4,
                            "3月": 6,
                            "4月": 6,
                            "5月": 5,
                            "6月": 5,
                            "7月": 4,
                            "8月": 4,
                            "9月": 4
                        }
                    }
                }
            })
        }),
    ],
}
export default mock